[{"message":"Construction workers are on the roof of the building across my apartment listening to Nickelback. At first, I thought it was just the radio, but I just noticed it's an entire Nickelback album... FML.","time":1350419058,"place_id":null},{"message":"Found out one of the laundry machines in my apartment starts if I insert one quarter, kick the side, and insert another quarter. Apparently, my kick is valued at $1.00","time":1349041589,"place_id":null},{"message":"Throughout all of The Avengers, all I could think was, \"Robin - I know you love hanging out with all your buddies in NYC, but how about we leave saving the city\/world to the super heroes...\"","time":1336805312,"place_id":null},{"message":"Officially part of Class XVIII of the Hoeft Technology and Management Program!!!","time":1330544824,"place_id":null},{"message":"Listening to Simian Mobile Disco, Friendly Fires, and Penguin Prison while learning the programming language of hipsters - Ruby. What has happened to me, Jonathan?!","time":1330116992,"place_id":null},{"message":"You know you are in the heart of Silicon Valley when the WiFi from Google's headquarters shows up stronger than the network of the house you are staying in.","time":1324491404,"place_id":null},{"message":"For my entire life, this is the longest I have gone without being with you, TexMex. I must confess that during our time apart, I have been with others. I’ll admit, I ate Chipotle’s tacos every once in a while. Hell, I even had Qdoba a couple times, but all I could think about was you. I’m coming back to Austin on Saturday and I want you to know that I won't stop thinking about you until I get a taste of your hot sauce.","time":1323984502,"place_id":null},{"message":"Just edited my sister's high school English paper. First time in like a year I've seen school work without numbers, integrals, matrices, and\/or computer code. #lifeofanengineer #mespeeknumberz #firsttimeusinghashtags #amidoingthisright?","time":1323667469,"place_id":null},{"message":"To the bros filming themselves at the gym: I hope you notice that in half your shots, I am standing in the back video bombing the s**t out of your brocumentary.","time":1322971537,"place_id":null},{"message":"Note to self: do not remind roommate that Talking Tom exists. EVER.","time":1322891943,"place_id":null},{"message":"Off to Toronto, CA. Can't wait to get out and aboot the city and see family, eh?","time":1321716700,"place_id":null},{"message":"An important skill that everyone learns in college: finding the threshold of what you are willing to sit through or do for free food and clothing.","time":1320889847,"place_id":null},{"message":"Linear Algebra exam postponed until Wednesday. Thank god for TA's who show up late because they are still hung over at 2pm on a Monday.","time":1320698141,"place_id":null},{"message":"Cooking up some jsoup. Yummy.","time":1319932475,"place_id":null},{"message":"Just got an offer to earn revenue from my YouTube videos. I forgot I even had a channel... lol. Has anybody done this? If so, is it worth it?","time":1319853774,"place_id":null},{"message":"Surabhi Rao and Vaidehi Sishtla are not just my homework buddies. They are my BFFLs \u003C3","time":1319816185,"place_id":null},{"message":"Meant to type \"pseudo-...\" in a paper. Instead wrote \"sudo-...\". Took me a while to realize what was wrong. MLIL (My Life Is Linux).","time":1318805149,"place_id":null},{"message":"Thoroughly convinced that \"Helena Beat\" and \"Call It What You Want\" on repeat makes me write Mathematica code faster. Get owned Math 415.","time":1318135961,"place_id":null},{"message":"Tonight, when turning in my exam, the TA asked me to take off my glasses when I showed him my iCard. He then glanced between my face, the iCard and my exam for around a minute. I got kind of annoyed so I half-jokingly took out my driver's license. After another minute, he finally agreed that I was, in fact, THE Rishi Bajekal. Kind of wanted to ask him if he wanted my social security number and passport as well...","time":1317695342,"place_id":null},{"message":"Earlier today, I saw a hawk swoop down from a building and grab a squirrel from the ground right next to me. I keep hearing those final squeals in my head... :-\/","time":1317356144,"place_id":null},{"message":"Staying up all night for Facebook Hackathon or staying in, sleeping early and recovering from week-long sickness? I am thinking I'm going with the latter. :-\/","time":1315604230,"place_id":null},{"message":"A professor just gave us a 5 input truth table to do by hand. It's purely mechanical, inane work that teaches us nothing new from previous classes, but it's completely justified because she thought it was cute that the logical expression spells out \"ILLINOIS\". lolomgwtfbbq","time":1314986361,"place_id":null},{"message":"How do some people consistently wear clothes to the gym that are nicer than the nicest clothes I have ever owned, or even worn, in my life?","time":1314585724,"place_id":null},{"message":"2 months of no rain in Austin. Huge downpour on the 2nd day of classes in Champaign\/Urbana.","time":1314134526,"place_id":null},{"message":"Perfect last day of internship - 4 hours of solid work completed in 3 hours in the morning, department meeting, then 7 amazing hours out on a boat in Lake Travis with the Master Data Management team.","time":1313203611,"place_id":null},{"message":"Yesterday, my dad's flight was delayed by 30 minutes because the amount of obese people on the plane exceeded the number of seat belt extenders available. God bless America...","time":1311904383,"place_id":null},{"message":"Played squash for the first time today. Definitely won't be the last...","time":1309751604,"place_id":null},{"message":"So glad they finally added Austin\/Round Rock to the DCI stops. Can't wait for San Antonio!","time":1308538384,"place_id":null},{"message":"Yo IBM. The least you could do for your 100th birthday party is give us all a company-wide nap time. Think of it as a party favor for grown-ups.","time":1308252725,"place_id":null},{"message":"Becoming a robot. Help.","time":1308023377,"place_id":null},{"message":"Excited for my first day of work tomorrow. Not excited for the paperwork that will be there to greet me.","time":1306119962,"place_id":null},{"message":"There is something oddly calming about driving alone with music playing on a summer night in Austin. Anybody else get this feeling?","time":1305691999,"place_id":null},{"message":"Good to be back home in beautiful Austin, Texas. First item on to-do list: Get some Torchy's Tacos!!!","time":1305435732,"place_id":null},{"message":"All-nighter for packing. Irony is a funny yet cruel thing... lol","time":1305294667,"place_id":null},{"message":"Post-finals hallway tennis in the basement with Jeremy Lin. Success.","time":1305186221,"place_id":null},{"message":"Are we done yet...?","time":1303680673,"place_id":null},{"message":"This summer I'm going to take my talents to Austin and join IBM. \u003C- lol \u0040 Lebron reference.","time":1303169841,"place_id":null},{"message":"The Verizon \"can-you-hear-me-now\" guy was fired. AT&T should capitalize on this and have him say, \"I can hear you now.\" lol","time":1302823814,"place_id":null},{"message":"Yuri's Night was a blast (get it?!)! A big thanks to Akash Shah and ISS for helping me maintain my sanity after 3 hours of coding. :D","time":1302705117,"place_id":null},{"message":"Just owned a differential equations quiz that I thought I would fail. How can you slap, Bartek!","time":1301593425,"place_id":null},{"message":"INDIA WINS!!!","time":1301505347,"place_id":null},{"message":"U of I people: the fire on Green St. was at Zorba's and Mia Za's. It doesn't look too promising... :(\nhttp:\/\/twitpic.com\/4cfp63","time":1300896854,"place_id":null},{"message":"Why does 85 degrees feel like I'm sitting in a sauna??? At least I am home. I have missed you more than you will ever know, Austin.","time":1300578829,"place_id":null},{"message":"I am pretty sure my weather tolerance has shifted down by 1-20 degrees Fahrenheit. It was a beautiful 60 degrees today in Champaign and I was feeling hot... How am I going to survive a Texas summer?","time":1300406551,"place_id":null},{"message":"I have the sudden urge to form a latin-funk band... who's in?","time":1299815830,"place_id":null},{"message":"YESSSS... hundreds of lines of code later and I am finally done. Who wants to go workout at CRCE before dinner?","time":1299710356,"place_id":null},{"message":"I wouldn't be surprised if I dream in 0's and 1's tonight. Coding in machine language makes my head spin... :-\/","time":1298863184,"place_id":null},{"message":"Rain + terrible Differential Equations test... Thank god the Skrillex concert is this Thursday.","time":1298315361,"place_id":null},{"message":"To any audiophiles out there - what is your opinion on \"breaking in\" high-end headphones when you first get them?","time":1297367061,"place_id":null},{"message":"CRCE during the Super Bowl... greatest idea this semester. Good thinking, Akshay Malik","time":1297052520,"place_id":null},{"message":"just realized that his Diff. Eq. Plus professor sounds EXACTLY like Gru from Despicable Me.\nAkshay Malik Christopher Alan Baker","time":1296885140,"place_id":null},{"message":"To guy living above me, please stop blasting the Inception soundtrack. It's making me feel like this whole week has just been a dream...","time":1296254413,"place_id":null},{"message":"I swear I just heard a Dr. Beat go off for a few seconds. I think I'm either going crazy or having metronome withdrawals...","time":1295827223,"place_id":null},{"message":"Semester 2... FIGHT!","time":1295318869,"place_id":null},{"message":"What better way to celebrate on Christmas Eve than applying for internships?","time":1293229133,"place_id":null},{"message":"is done... phew.","time":1292263801,"place_id":null},{"message":"\u0040calc3 final: GTFO noob. We learned from Prof. Tron.\n\nAkshay Malik Christopher Alan Baker","time":1292004564,"place_id":null},{"message":"does not like single digit weather...","time":1291738049,"place_id":null},{"message":"Never thought I'd ever be back in Texas along with the Marching Illini. Texas Bowl 2010. Let's do this, Illini!","time":1291688946,"place_id":null},{"message":"Performing at halftime with the Illini Drumline for UNC vs. Illinois B-Ball tonight. Watch it at 8:30 CT on ESPN or www.ESPN3.com.","time":1291150835,"place_id":null},{"message":"Going back to 25 degree weather after a beautiful week in 75 degree weather. meh.","time":1290750640,"place_id":null},{"message":"Just met John McLaughlin and talked to him for 10 minutes backstage after seeing his amazing set with 4th Dimension. Am I dreaming right now?!","time":1290576107,"place_id":null},{"message":"Akash Shah just told a robot that he \"found the serial number\". Now he is laughing at an Apple tech support guy.","time":1290482887,"place_id":null},{"message":"A commonly overlooked benefit of coming home: 2-ply toilet paper.","time":1290270412,"place_id":null},{"message":"Getting back to Austin tonight! Finally time to relax for a bit.","time":1290195571,"place_id":null},{"message":"DONE ...for the most part until after Thanksgiving. Phew.","time":1289974860,"place_id":null},{"message":"The new Girl Talk album has some great samples! First tune alone has some really catchy tunes that somehow manage to fit together. War Pigs, Empire State of Mind, Teach Me How to Dougie, Blitzkrieg Bop... the list goes on!","time":1289945888,"place_id":null},{"message":"Most likely no bowl game for the Illini. Too bad our last game ended up being cold, rainy and not too enjoyable.","time":1289685346,"place_id":null},{"message":"I can just imagine the stories now, Ani Mesh , Vivek Mohan, and Akshay Malik: \n\n\"Hey guys! Remember all the crazy shit we used to do in college?!\"\n\"Yeah! Remember that time we spent 10 hours straight locked up in a room for the Microsoft Puzzle Challenge?\"\n\nwe have no lives and never will... lololol. \"What is above all?\"","time":1289111376,"place_id":null},{"message":"FML. FYCARE for the next 2 hours...","time":1288900447,"place_id":null},{"message":"Dubstep and double integrals. Perhaps a little sleep as well?","time":1288847111,"place_id":null},{"message":"To girl on rollerblades: please get some shoes. It's not much faster to skate around campus when you crash into 3 different people on 1 block... lulz failblog.","time":1288826201,"place_id":null},{"message":"is learning some proprietary language to do an ECE 110 PRElab. The best part is that the microcontroler that uses this language hasn't been used in the ECE 110 lab since 2 years ago... screw this.","time":1288673233,"place_id":null},{"message":"I have never wanted Taco Cabana more in my entire life. I think I might try and convince my mom to get Taco C for Thanksgiving dinner... Jonathan Lai Kartik Hattangadi Travis Owen Ben Mercado","time":1288232204,"place_id":null},{"message":"w00t \u0040 no band today. anti-w00t \u0040 doing lots of homework instead.","time":1288032491,"place_id":null},{"message":"U of I folks - Anybody know an easy (and hopefully somewhat interesting) Gen Ed course to get the non-Western studies credit next semester? I am considering MUS 133, but I'm still looking around.","time":1287975978,"place_id":null},{"message":"Oh boy! I love parades and pep rallies so much..... UUUUUUUUHHHHHHHHHHHHHHHGGGGGG....","time":1287797668,"place_id":null},{"message":"ECE Exam 2 wasn't horrible, but wasn't too easy either. Hoping to beat the average again. Studying for tomorrow's Calc III Exam 2 and then relaxing... a lot.","time":1287455110,"place_id":null},{"message":"Festival is today! That means getting to throw down for a huge crowd at Public and, more importantly, finally being able to shave. Let's do it up, Snapper Tappers!","time":1287246557,"place_id":null},{"message":"\"Marching Illini in Concert\" at 3pm in Assembly Hall. With crazy light show and more... come watch.","time":1286730474,"place_id":null},{"message":"is doing laundry... at midnight. lulz wtf dorm life.","time":1286516664,"place_id":null},{"message":"Surprisingly, not a horrible game against OSU. Good job today, Illini (both football team and bandy band). Now that the game is over with, time to eat...","time":1286051378,"place_id":null},{"message":"I just got a long-needed haircut but cannot shave for another 2 weeks. FML.","time":1285866956,"place_id":null},{"message":"iPan at Zorba's was great. There's nothing like listening to an awesome steel drum band to relax after a stressful week of school.","time":1285395367,"place_id":null},{"message":"Who knew that those simple topographic maps that we learned how to read and draw in 2nd grade at Highland Park would be the most useful skill I have used in Vector Calculus thus far... lol","time":1285359565,"place_id":null},{"message":"just saw a guy rockin' the good old Sony Walkman with beltclip and all. s0 r3tr0.","time":1285200575,"place_id":null},{"message":"is done with exams... for now.","time":1285124873,"place_id":null},{"message":"To those of you who see me within in the next month - no, I have not given up on my personal appearance. I cannot shave due to crazy Illinois drumline traditions. In other news, I'm ready to pwn this ECE exam tomorrow!","time":1284957787,"place_id":null},{"message":"As funny as it was that Nick 尼克 Clark was accused of urinating on our floors, I think the joke might just be the truth after this whole bathroom stall incident... Thoughts from any other fellow innovators of Townsend 2South? lol","time":1284862092,"place_id":null},{"message":"had a blast at the game. Awesome game and great public warmup. On to studying...","time":1284845482,"place_id":null},{"message":"Akshay Malik and I almost have this Japanese T-shirt folding thing mastered.","time":1284436992,"place_id":null},{"message":"is sick and home-sick.","time":1284429032,"place_id":null},{"message":"Akshay Malik and I both agree that the guy living above us needs to stop singing out of tune to loud music and watching 4 straight episodes of \"Friends\" at midnight every night...","time":1284058559,"place_id":null},{"message":"Exhausted from first my first college show. Horrible football game, but great experience. Nap time and then Base.","time":1283648186,"place_id":null},{"message":"can't wait to march his first college show in the Edward Jones Dome (home of the St. Louis Rams) this Saturday with the Illini Drumline! Let's show Mizzou how to drum (and hopefully how to play football as well...).","time":1283488990,"place_id":null},{"message":"Why do two people about 3 doors down from each other in the same hallway \ninsist on opening their doors and blasting their own horrible music? \nQuiet hours should take effect the moment these guys even THINK about playing that junk. One is playing a bunch of sappy slow jam R&B and another one is playing mainstream hip hop... it could not be any worse.","time":1282683262,"place_id":null},{"message":"was so tempted to sign up for the L.A.R.P club after watching the battle that ensued during Quad Day today. SLEEP! LIGHTNING BOLT!!!","time":1282505934,"place_id":null},{"message":"aptly renamed the paradiddle-four the Sherpa-Derk.","time":1282363801,"place_id":null},{"message":"took a tumble on his first day of marching in college after having never fallen once in 4 years of high school marching band. I hate XL carriers...","time":1282170201,"place_id":null},{"message":"9:00-11:00 move-in and meet roommate. 12:00-12:30 eat lunch. 1:00-4:30 band camp. 4:45-6:30 eat dinner and LLC orientation. 7:00-9:00 more band camp. \n\n... and this is my first day on campus?!","time":1282102384,"place_id":null}]